Benchmark_tests/experiment2/concurrent_200.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.244.204.124 (be patient)


Server Software:        gunicorn/19.9.0
Server Hostname:        35.244.204.124
Server Port:            80

Document Path:          /
Document Length:        688 bytes

Concurrency Level:      200
Time taken for tests:   15.393 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      5285000 bytes
HTML transferred:       3440000 bytes
Requests per second:    324.83 [#/sec] (mean)
Time per request:       615.712 [ms] (mean)
Time per request:       3.079 [ms] (mean, across all concurrent requests)
Transfer rate:          335.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       57  104  49.8     91    1123
Processing:   321  492 144.0    443    1118
Waiting:      321  491 143.9    442    1118
Total:        386  596 163.3    544    1622

Percentage of the requests served within a certain time (ms)
  50%    544
  66%    610
  75%    665
  80%    701
  90%    817
  95%    924
  98%   1084
  99%   1206
 100%   1622 (longest request)