Benchmark_tests/experiment2/concurrent_250.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.244.204.124 (be patient)


Server Software:        gunicorn/19.9.0
Server Hostname:        35.244.204.124
Server Port:            80

Document Path:          /
Document Length:        688 bytes

Concurrency Level:      250
Time taken for tests:   12.725 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      5285000 bytes
HTML transferred:       3440000 bytes
Requests per second:    392.92 [#/sec] (mean)
Time per request:       636.259 [ms] (mean)
Time per request:       2.545 [ms] (mean, across all concurrent requests)
Transfer rate:          405.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       67  116  17.1    115     230
Processing:   334  497 120.3    459    1119
Waiting:      332  496 120.3    458    1118
Total:        420  614 121.7    579    1269

Percentage of the requests served within a certain time (ms)
  50%    579
  66%    636
  75%    678
  80%    712
  90%    792
  95%    855
  98%    931
  99%    993
 100%   1269 (longest request)