Benchmark_tests/experiment2/concurrent_50.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 35.244.204.124 (be patient)


Server Software:        gunicorn/19.9.0
Server Hostname:        35.244.204.124
Server Port:            80

Document Path:          /
Document Length:        688 bytes

Concurrency Level:      50
Time taken for tests:   70.672 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      5285000 bytes
HTML transferred:       3440000 bytes
Requests per second:    70.75 [#/sec] (mean)
Time per request:       706.725 [ms] (mean)
Time per request:       14.134 [ms] (mean, across all concurrent requests)
Transfer rate:          73.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       55   86  33.8     79    1083
Processing:   315  618 351.8    499    2760
Waiting:      315  617 351.8    499    2760
Total:        382  704 352.1    591    2839

Percentage of the requests served within a certain time (ms)
  50%    591
  66%    694
  75%    779
  80%    801
  90%   1313
  95%   1399
  98%   1665
  99%   2240
 100%   2839 (longest request)